// © Copyright 2012-2013, 2015-2016 HP Development Company, L.P.

// Task name & description
HSDTaskName = "Параметры прокси-сервера";
HSDTaskDescription = "Принтер поддерживает подключение к Интернету. При подключении к Интернету с использованием прокси-сервера, установите следующие параметры.";
TaskDescriptionInAssistantMode = "Для использования веб-служб HP принтер должен быть подключен к Интернету. Если для подключения к Интернету используется прокси-сервер, ниже укажите следующие параметры.\n\nЕсли параметры прокси неизвестны, см. параметры на панели \"Сеть\" или обратитесь к системному администратору.";

// Radio buttons matrix
HSDProxyServerNotRequiredTitle = "Для подключения к Интернету не требуется прокси-сервер";
HSDAutomaticProxySettingsTitle = "Автоматически (устройство обнаружит настройки автоматически)";
HSDCustomProxySettingsTitle = "Особая конфигурация прокси-сервера:";
HSDSystemProxySettingsTitle = "Копировать системные настройки";

// Proxy server settings
HSDProxyServerTitle = "Прокси-сервер:";
ProxyPortTitle = "Порт прокси-сервера:";

// Authentication
HSDRequiresAuthenticationButton = "Прокси-серверу требуется проверка подлинности";
HSDUserNameTitle = "Имя пользователя:";
HSDPasswordTitle = "Пароль:";

HSDApplyNowButtonTitle = "Применить";

// progress titles
UpdateInformationProcessTitle = "Обновление данных...";

// alerts
EmptyProxyServerOrPortErrorText = "Необходимо указать прокси-сервер и порт прокси-сервера.";

EmptyUserNameOrPasswordErrorText = "Для проверки подлинности прокси-сервера необходимо ввести пароль и имя пользователя.";

IncorrectProxyServerNameFormatErrorText = "Не удалось задать имя прокси-сервера. Проверьте правильность его формата.";

HSDUserNameTooLargeErrorText = "Имя пользователя слишком длинное. Максимальное количество символов имени пользователя, поддерживаемое вашим устройством: %d.";
